Repository: nistrahq/demy-teachers
Catalog: lib/core/localization/l10n/app_*.arb
Languages: es

source: Welcome
es: Bienvenido

source: Login
es: Iniciar sesión

source: Email
es: Correo electrónico

source: Password
es: Contraseña

# signInTitle
source: Sign in
es: Iniciar sesión

# signInSubtitle
source: Enter your credentials provided by your administrator to continue
es: Ingrese sus credenciales otorgadas por su administrador para continuar

# signInButton
source: Sign in
es: Iniciar sesión

source: Forgot password?
es: ¿Olvidaste tu contraseña?

# emailRequired
source: Email is required
es: El correo electrónico es obligatorio

# passwordRequired
source: Password is required
es: La contraseña es obligatoria

source: Home
es: Inicio

source: Profile
es: Perfil

source: Settings
es: Configuración

# homePageTitle
source: Welcome to Demy Teachers
es: Bienvenido a Demy Teachers

# homePagePlaceholder
source: Home content coming soon...
es: El contenido del inicio estará disponible pronto...

# profilePageTitle
source: My Profile
es: Mi Perfil

# profilePagePlaceholder
source: Profile information coming soon...
es: La información del perfil estará disponible pronto...

# settingsPageTitle
source: Settings
es: Configuración

# settingsPagePlaceholder
source: Settings options coming soon...
es: Las opciones de configuración estarán disponibles pronto...

# registerAttendanceButtonLabel
source: Take Attendance
es: Registrar Asistencia

# attendanceReportTitle
source: Attendance Report
es: Reporte de Asistencia

# studentsLabel
source: Students
es: Estudiantes

# saveAttendanceButton
source: Save Attendance
es: Guardar Asistencia

# attendanceSavedSuccess
source: Attendance saved successfully
es: Asistencia guardada exitosamente

# courseLabel
source: Course
es: Curso

# startDateLabel
source: Start Date
es: Fecha Inicio

# endDateLabel
source: End Date
es: Fecha Fin

# statusPresentAbbr
source: P
es: A

# statusExcusedAbbr
source: E
es: J

# statusAbsentAbbr
source: A
es: F

# errorLoadingStudents
source: Error loading student list: {error}
es: Error al cargar la lista: {error}

# viewAttendanceReportButton
source: View Attendance Report
es: Ver Reporte de Asistencia

# teachingScheduleButton
source: Teaching Schedule
es: Horario de Clases

# viewNotificationsButton
source: View Notifications
es: Ver Notificaciones

# todayScheduleTitle
source: Today Schedule
es: Agenda de Hoy

# viewAllLink
source: View all >
es: Ver todo >

# notificationsPageTitle
source: Notifications
es: Notificaciones

# welcomeNotificationTitle
source: Welcome to Demy for Teachers
es: Bienvenido a Demy for Teachers

# welcomeNotificationDescription
source: You have successfully signed in to the app, start managing your schedules, attendance, and more.
es: Has iniciado sesión en la aplicación, comienza a gestionar tus horarios, asistencia y más.

# phoneNumberLabel
source: Phone Number
es: Número de teléfono

# resetPasswordButton
source: Reset Password
es: Restablecer Contraseña

# forgotPasswordTitle
source: Forgot Password
es: Olvidé mi Contraseña

# forgotPasswordDescription
source: Enter your email address and we'll send you a verification code to reset your password
es: Ingresa tu dirección de correo electrónico y te enviaremos un código de verificación para restablecer tu contraseña

# emailHint
source: Enter your email
es: Ingresa tu correo electrónico

# emailInvalid
source: Please enter a valid email
es: Por favor ingresa un correo válido

# sendVerificationCodeButton
source: Send Verification Code
es: Enviar Código de Verificación

# verifyResetCodeTitle
source: Enter Verification Code
es: Ingresa tu Código de Verificación

# verifyResetCodeDescription
source: We sent a code to your email address, enter it to reset your password
es: Enviamos un código a tu correo electrónico, ingrésalo para restablecer tu contraseña

# verificationCodeLabel
source: Verification Code
es: Código de Verificación

# verificationCodeHint
source: Enter code
es: Ingresa el código

# verificationCodeRequired
source: Verification code is required
es: El código de verificación es obligatorio

# verifyCodeButton
source: Verify Code
es: Verificar Código

# resetPasswordTitle
source: Reset Password
es: Restablecer Contraseña

# resetPasswordDescription
source: Enter your new password and confirm it
es: Ingresa tu nueva contraseña y confírmala

# oldPasswordLabel
source: Current Password
es: Contraseña Actual

# oldPasswordHint
source: Enter your current password
es: Ingresa tu contraseña actual

# oldPasswordRequired
source: Current password is required
es: La contraseña actual es obligatoria

# newPasswordLabel
source: New Password
es: Nueva Contraseña

# newPasswordHint
source: Enter your new password
es: Ingresa tu nueva contraseña

# newPasswordRequired
source: New password is required
es: La nueva contraseña es obligatoria

# newPasswordTooShort
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

# confirmPasswordLabel
source: Confirm Password
es: Confirmar Contraseña

# confirmPasswordHint
source: Confirm your new password
es: Confirma tu nueva contraseña

# confirmPasswordRequired
source: Please confirm your password
es: Por favor confirma tu contraseña

source: Passwords do not match
es: Las contraseñas no coinciden

# submitButton
source: Submit
es: Enviar

# resetPasswordSuccessTitle
source: Password Reset Successful!
es: ¡Contraseña Restablecida Exitosamente!

# resetPasswordSuccessMessage
source: Your password has been reset successfully. You can now sign in with your new password.
es: Tu contraseña ha sido restablecida exitosamente. Ahora puedes iniciar sesión con tu nueva contraseña.

# goToHomeButton
source: Go to Home
es: Ir al Inicio

source: Terms and Conditions
es: Términos y Condiciones

source: Privacy Policy
es: Política de Privacidad

source: Sign Out
es: Cerrar Sesión

# termsSection1Title
source: 1. Acceptance of Terms
es: 1. Aceptación de los Términos

# termsSection1Content
source: By using the Demy platform, you accept these terms. Demy is an academic management system for academies and educational centers.
es: Al usar la plataforma Demy aceptas estos términos. Demy es un sistema de gestión académica para academias y centros educativos.

# termsSection2Title
source: 2. Service Description
es: 2. Descripción del Servicio

# termsSection2Content
source: Demy offers tools for:
es: Demy ofrece herramientas para:

# termsSection2Item1
source: Enrollment and student management
es: Gestión de matrículas y estudiantes

# termsSection2Item2
source: Schedule and class administration
es: Administración de horarios y clases

# termsSection2Item3
source: Payments, billing and financial control
es: Pagos, facturación y control financiero

# termsSection2Item4
source: Reports and academic tracking
es: Reportes y seguimiento académico

# termsSection2Item5
source: Communication with students and parents
es: Comunicación con estudiantes y padres

# termsSection2Item6
source: Teacher and staff management
es: Gestión de profesores y personal

# termsSection3Title
source: 3. User Accounts
es: 3. Cuentas de Usuario

# termsSection3Content
source: You must create an account with correct information. You are responsible for your password and activities within your account. If there is unauthorized use, you must report it.
es: Debes crear una cuenta con información correcta. Eres responsable de tu contraseña y de las actividades dentro de tu cuenta. Si hay uso no autorizado, debes reportarlo.

# termsSection4Title
source: 4. Acceptable Use
es: 4. Uso Aceptable

# termsSection4Content
source: Demy can only be used for academic purposes. The following is not permitted:
es: Demy solo puede usarse para fines académicos. No está permitido:

# termsSection4Item1
source: Illegal or unauthorized activities
es: Actividades ilegales o no autorizadas

# termsSection4Item2
source: Interfering with the platform
es: Interferir con la plataforma

# termsSection4Item3
source: Attempting to access other accounts
es: Intentar acceder a cuentas ajenas

# termsSection4Item4
source: Providing false information
es: Proporcionar información falsa

# termsSection4Item5
source: Infringing intellectual property
es: Infringir propiedad intelectual

# termsSection5Title
source: 5. Data and Content
es: 5. Datos y Contenido

# termsSection5Content
source: The data you enter is yours. You give us permission to process and store it only to provide the service. We protect sensitive information and maintain its confidentiality.
es: Los datos que ingresas son tuyos. Nos das permiso para procesarlos y almacenarlos solo para ofrecer el servicio. Protegemos la información sensible y mantenemos su confidencialidad.

# termsSection6Title
source: 6. Billing and Payments
es: 6. Facturación y Pagos

# termsSection6Content
source: The service works through monthly or annual subscription. Renewal is automatic. You can cancel at any time from your control panel.
es: El servicio funciona mediante suscripción mensual o anual. La renovación es automática. Puedes cancelar en cualquier momento desde tu panel de control.

# termsSection7Title
source: 7. Limitation of Liability
es: 7. Limitación de Responsabilidad

# termsSection7Content
source: Demy is offered "as is". We do not guarantee that it is free of errors or interruptions. Our liability is limited to the amount paid during the last 12 months.
es: Demy se ofrece "tal como está". No garantizamos que esté libre de errores o interrupciones. Nuestra responsabilidad se limita al monto pagado durante los últimos 12 meses.

# termsSection8Title
source: 8. Termination
es: 8. Terminación

# termsSection8Content
source: We may suspend your access if you violate the terms. If the service ends, your data can be downloaded for 30 days before being deleted.
es: Podemos suspender tu acceso si incumples los términos. Si el servicio termina, tus datos podrán descargarse por 30 días antes de ser eliminados.

# termsSection9Title
source: 9. Modifications
es: 9. Modificaciones

# termsSection9Content
source: We may update these terms. If there are important changes, we will notify you 30 days in advance. Continuing to use Demy implies accepting the new terms.
es: Podemos actualizar estos términos. Si hay cambios importantes, avisaremos con 30 días de anticipación. Seguir usando Demy implica aceptar los nuevos términos.

# termsSection10Title
source: 10. Contact
es: 10. Contacto

# termsSection10Content
source: For inquiries: contact.demyteam@gmail.com
es: Para consultas: contact.demyteam@gmail.com

# termsLastUpdated
source: Last updated: December 2025
es: Última actualización: Diciembre 2025

# privacySection1Title
source: 1. Information We Collect
es: 1. Información que Recopilamos

# privacySection1Content
source: We collect data necessary to operate the platform:
es: Recopilamos datos necesarios para operar la plataforma:

# privacySection1Item1
source: Institution data (name, address, contact, tax information)
es: Datos de la institución (nombre, dirección, contacto, información fiscal)

# privacySection1Item2
source: Administrators (name, email, roles)
es: Administradores (nombre, correo, roles)

# privacySection1Item3
source: Students (academic data, contact, payment history with authorization)
es: Estudiantes (datos académicos, contacto, historial de pagos con autorización)

# privacySection1Item4
source: Teachers (professional information, schedules, courses)
es: Profesores (información profesional, horarios, cursos)

# privacySection1Item5
source: Platform usage (activity, preferences, logs)
es: Uso de la plataforma (actividad, preferencias, logs)

# privacySection2Title
source: 2. Use of Information
es: 2. Uso de la Información

# privacySection2Content
source: We use the data to:
es: Usamos los datos para:

# privacySection2Item1
source: Provide and improve services
es: Brindar y mejorar los servicios

# privacySection2Item2
source: Manage enrollments, schedules and payments
es: Gestionar matrículas, horarios y pagos

# privacySection2Item3
source: Generate reports
es: Generar reportes

# privacySection2Item4
source: Facilitate communication
es: Facilitar comunicación

# privacySection2Item5
source: Maintain system security
es: Mantener la seguridad del sistema

# privacySection2Item6
source: Comply with legal obligations
es: Cumplir obligaciones legales

# privacySection3Title
source: 3. Academic Data Protection
es: 3. Protección de Datos Académicos

# privacySection3Content
source: We apply special measures such as:
es: Aplicamos medidas especiales como:

# privacySection3Item1
source: Encryption of sensitive data
es: Encriptación de datos sensibles

# privacySection3Item2
source: Access by roles and permissions
es: Acceso por roles y permisos

# privacySection3Item3
source: Periodic audits
es: Auditorías periódicas

# privacySection3Item4
source: Secure backups
es: Respaldos seguros

# privacySection3Item5
source: Compliance with educational standards
es: Cumplimiento de normas educativas

# privacySection4Title
source: 4. Sharing Information
es: 4. Compartir Información

# privacySection4Content
source: We do not sell data. We only share when:
es: No vendemos datos. Solo compartimos cuando:

# privacySection4Item1
source: Required by educational authorities
es: Es requerido por autoridades educativas

# privacySection4Item2
source: Needed by technical providers under confidentiality
es: Lo necesitan proveedores técnicos bajo confidencialidad

# privacySection4Item3
source: The institution authorizes it
es: La institución lo autoriza

# privacySection4Item4
source: There is a legal or judicial obligation
es: Existe obligación legal o judicial

# privacySection5Title
source: 5. Data Retention
es: 5. Retención de Datos

# privacySection5Item1
source: Academic: minimum 5 years
es: Académicos: mínimo 5 años

# privacySection5Item2
source: Billing: 7 years
es: Facturación: 7 años

# privacySection5Item3
source: Access logs: 2 years
es: Logs de acceso: 2 años

# privacySection5Item4
source: Contact: until deletion is requested
es: Contacto: hasta solicitar eliminación

# privacySection6Title
source: 6. Your Rights
es: 6. Sus Derechos

# privacySection6Content
source: The institution can:
es: La institución puede:

# privacySection6Item1
source: Access and export its data
es: Acceder y exportar sus datos

# privacySection6Item2
source: Correct information
es: Corregir información

# privacySection6Item3
source: Request portability
es: Solicitar portabilidad

# privacySection6Item4
source: Restrict processing
es: Restringir el procesamiento

# privacySection6Item5
source: Request deletion (according to law)
es: Pedir eliminación (según ley)

# privacySection6Item6
source: Be notified of security breaches
es: Ser notificada ante brechas de seguridad

# privacySection7Title
source: 7. International Transfers
es: 7. Transferencias Internacionales

# privacySection7Content
source: Data may be processed outside the country under international standards and approved protection clauses.
es: Los datos pueden procesarse fuera del país bajo estándares internacionales y cláusulas de protección aprobadas.

# privacySection8Title
source: 8. Minors
es: 8. Menores de Edad

# privacySection8Content
source: We require consent from parents or guardians. Minor data is handled with additional protection and only for educational purposes.
es: Requerimos consentimiento de padres o tutores. Los datos de menores se manejan con protección adicional y solo para fines educativos.

# privacySection9Title
source: 9. Policy Changes
es: 9. Cambios a la Política

# privacySection9Content
source: We will notify important changes 30 days in advance. Minor changes will be published directly.
es: Avisaremos cambios importantes con 30 días de anticipación. Los cambios menores se publicarán directamente.

# privacySection10Title
source: 10. Contact and DPO
es: 10. Contacto y DPO

# privacySection10Content
source: Privacy inquiries: contact.demyteam@gmail.com Data Protection Officer (DPO): dpo@demy.com
es: Consultas de privacidad: contact.demyteam@gmail.com Oficial de Protección de Datos (DPO): dpo@demy.com

# privacyLastUpdated
source: Last updated: December 2025
es: Última actualización: Diciembre 2025

# byUsingDemyYouAccept
source: By using Demy for Teachers, you accept the
es: Al usar Demy for Teachers, aceptas los

# and
source: and the
es: y la
